package util;

public class Utility {
	
	public static String SYSTEMHANDSHAKE = "superuserfor6talkWeb2013";
	
	private String[] collegeName = {
			"國立臺南大學",
			"國立台灣大學",
			"中臺科技大學",
			"中國醫藥大學",
			"國立暨南大學",
			"國立彰化師範大學",
			"國立雲林科技大學",
			"國立交通大學",
			"修平技術學院",
			"淡江大學",
			"佛光大學",
			"靜宜大學",
			"國立屏東教育大學",
			"亞洲大學",
			"聖約翰科技大學",
			"世新大學",
			"國立中正大學",
			"國立臺灣海洋大學",
			"吳鳳科技大學",
			"國立中興大學",
			"國立中央大學",
			"國立台中教育大學",
			"國立臺灣師範大學",
			"國立清華大學",
			"健行科技大學",
			"國立高雄餐旅大學",
			"大同大學",
			"國立台北科技大學",
			"國立成功大學",
			"明新科技大學",
			"正修科技大學",
			"國立聯合大學",
			"育達商業科技大學",
			"國立新竹教育大學",
			"國立台北教育大學",
			"朝陽科技大學"
			};
	public String[] getCollegeName() {
		return collegeName;
	}
	public String[] getPreCode() {
		return preCode;
	}
	private String[] preCode = {
			"9831",
			"926",
			"9310",
			"9312",
			"943",
			"9815",
			"9822",
			"929",
			"9901",
			"9765",
			"9761",
			"9316",
			"9842",
			"9816",
			"9771",
			"9275",
			"932",
			"9392",
			"9823",
			"9311",
			"9782",
			"9317",
			"9766",
			"930",
			"9281",
			"9846",
			"9761",
			"9769",
			"933",
			"9792",
			"9911",
			"9790",
			"9796",
			"9798",
			"9390",
			"9817"
		};	
}
